{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hello",
          "Hi",
          "Hello, how are you today?",
          "Hai there, how's it going?",
          "Good morning, how have you been?",
          "Hey, what's up?",
          "Hai, how are things?",
          "Good afternoon, how are you?",
          "Hey there, how's everything?",
          "Hello, how have you been doing?",
          "Ola, how's your day going?",
          "Good evening, how are you feeling today?",
          "Hey, how's life treating you?",
          "Hello, what's new with you?",
          "Hi, how are you holding up?",
          "Good morning, how's everything going?",
          "Hey, how's your day been so far?",
          "Hi there, what's going on?",
          "Hello, how have you been lately?",
          "Good afternoon, what's up?",
          "Hey, how's it been?",
          "Hi, how's your week going?",
          "Hello, how's your day shaping up?",
          "Hi, how have things been?",
          "Hey, how are you doing today?",
          "Good morning, what's happening?",
          "Hello, how's everything with you?",
          "Hi there, how's your week been?",
          "Hey, what's new with you?",
          "Hello, how are you feeling today?",
          "Hi, what's going on with you?",
          "Good afternoon, how's your day?",
          "Hey, how's life?",
          "Hi, what's happening in your world?",
          "Hello, how are you this fine day?",
          "Hi, what have you been up to?",
          "Hey there, how's your day treating you?",
          "Good evening, how have you been?",
          "Hello, how's everything on your end?",
          "Hi, how's your day unfolding?",
          "Hey, how are things with you?",
          "Hello, what's been going on with you?"
        ],
        "responses": [
        "Hello! I'm doing well, thanks. Do you have any questions for me?",
        "Hi there! I'm good, how about you? Is there anything you need to ask?",
        "Good morning! I'm fine, thank you. Do you have any questions?",
        "Hey! I'm doing great, thanks. Is there something you'd like to know?",
        "Hi! I'm well, thanks for asking. Do you have any questions for me?",
        "Good afternoon! I'm good, how can I help you today? Any questions?",
        "Hello! I'm fine, thank you. Do you have any questions on your mind?",
        "Hi there! I'm doing well. Is there anything you want to ask?",
        "Hey! I'm great, thanks. Do you have any questions for me?",
        "Good evening! I'm well, thanks. Do you have any questions you need answered?",
        "Hi! I'm doing well, thank you. Is there anything you'd like to ask?",
        "Hello! I'm fine, thanks. Do you have any questions you need help with?",
        "Good morning! I'm great, how about you? Any questions you have?",
        "Hey! I'm good, thank you. Do you have any questions for me today?",
        "Hi there! I'm well, how can I assist you? Any questions?",
        "Hello! I'm doing fine, thanks. Is there something you want to ask?",
        "Hi! I'm great, thanks for asking. Do you have any questions?",
        "Good afternoon! I'm well, is there anything you'd like to know?",
        "Hey! I'm doing well, how can I help you? Any questions?",
        "Hello! I'm good, thank you. Do you have any questions or concerns?"
        ]
      },
      {
        "tag": "thank you",
        "patterns": [
          "Thank you!",
          "Thanks a lot!",
          "I appreciate it!",
          "Thanks for your help!",
          "Thank you so much!",
          "You're a lifesaver, thanks!",
          "Thanks for the information!",
          "Thank you, this is very helpful!",
          "I really appreciate your assistance!",
          "Thanks, you've been very helpful!",
          "Thanks, that clears things up!",
          "Thank you for your help!",
          "Awesome, thanks!",
          "Thank you, I appreciate it!",
          "Many thanks!"
        ],
        "responses": [
          "You're welcome! If you have any more questions, feel free to ask.\n\nFeel free to submit any feedback or suggestions you have using the following link:\nhttps://forms.gle/CFcVGVkenBBTCZLe6.\n\nYour input helps us improve and provide better assistance in the future.",
          "Glad I could help! For further assistance, let me know.\n\nFeel free to submit any feedback or suggestions you have using the following link:\nhttps://forms.gle/CFcVGVkenBBTCZLe6.\n\nYour input helps us improve and provide better assistance in the future.",
          "Anytime! If you need more information, just ask.\n\nFeel free to submit any feedback or suggestions you have using the following link:\nhttps://forms.gle/CFcVGVkenBBTCZLe6.\n\nYour input helps us improve and provide better assistance in the future.",
          "No problem! If you have more questions, I'm here.\n\nFeel free to submit any feedback or suggestions you have using the following link:\nhttps://forms.gle/CFcVGVkenBBTCZLe6.\n\nYour input helps us improve and provide better assistance in the future.",
          "Happy to help! Don't hesitate to ask if you need anything else.\n\nFeel free to submit any feedback or suggestions you have using the following link:\nhttps://forms.gle/CFcVGVkenBBTCZLe6.\n\nYour input helps us improve and provide better assistance in the future.",
          "You're welcome! If you have any suggestions or feedback, please let me know.\n\nFeel free to submit any feedback or suggestions you have using the following link:\nhttps://forms.gle/CFcVGVkenBBTCZLe6.\n\nYour input helps us improve and provide better assistance in the future.",
          "I'm glad I could assist you. Feel free to ask more questions.\n\nFeel free to submit any feedback or suggestions you have using the following link:\nhttps://forms.gle/CFcVGVkenBBTCZLe6.\n\nYour input helps us improve and provide better assistance in the future.",
          "Anytime! If you have any suggestions for improvement, let us know.\n\nFeel free to submit any feedback or suggestions you have using the following link:\nhttps://forms.gle/CFcVGVkenBBTCZLe6.\n\nYour input helps us improve and provide better assistance in the future.",
          "No problem at all! For any further questions, you can ask them here.\n\nFeel free to submit any feedback or suggestions you have using the following link:\nhttps://forms.gle/CFcVGVkenBBTCZLe6.\n\nYour input helps us improve and provide better assistance in the future.",
          "Happy to help! We value your feedback and questions, so feel free to share.\n\nFeel free to submit any feedback or suggestions you have using the following link:\nhttps://forms.gle/CFcVGVkenBBTCZLe6.\n\nYour input helps us improve and provide better assistance in the future."
        ]
      },
      {
        "tag": "grocery",
        "patterns": [
          "Could you recommend me some grocery stores with good prices?",
          "What are some grocery stores known for their low prices?",
          "Where can I find affordable grocery stores?",
          "Can you suggest some budget-friendly grocery stores?",
          "Which grocery stores offer the best prices?",
          "Do you know any grocery stores with great deals on groceries?",
          "Can you recommend places to buy groceries cheaply?",
          "What are some cost-effective grocery stores to shop at?",
          "Where can I shop for groceries on a budget?",
          "Which stores have the most affordable groceries?",
          "Can you suggest any grocery stores with reasonable prices?",
          "Which grocery stores have the best prices on food items?",
          "Where can I find grocery stores with competitive pricing?",
          "What are some supermarkets with affordable grocery options?",
          "Can you name grocery stores that offer good value for money?",
          "Where can I shop for groceries without spending too much?",
          "Do you have any recommendations for grocery stores with low costs?",
          "Which stores offer the most budget-friendly groceries?",
          "What grocery stores provide the best bargains?",
          "Where can I get the best deals on groceries?",
          "Can you list grocery stores that are known for their cheap prices?"
        ],
        "responses": [
          "If you are planning to buy some groceries for yourself, there are several mall that you can visit that have grocery store:\n\n1. Jaya One Aeon Big\nhttps://maps.app.goo.gl/AZ9q1Y1ZpttneErv9 \n\n 2. The Sphere Aeon\nhttps://maps.app.goo.gl/kbcoSLFfC8JBV8ug7 \n\n 3. KL Gateway Village Grocer\nhttps://maps.app.goo.gl/GU6EYddzJ9cpcy5S9\n\nAdditionally, there is a night market every every Tuesday where you can find fresh local produce and local goods. The night market held behind the UM International House. Below are the location of the night market:\nhttps://maps.app.goo.gl/C2Jkzj9DtwDMDNhY7\n\nLastly, if you are looking for basic items such as eggs, instant noodles, snacks, etc, you may go to KK Mart, which is located at Kompleks Perdanasiswa (KPS) and also Kolej Kediaman 12 (KK12) in University Malaya."
        ]
      },
      {
        "tag": "ISC office",
        "patterns": [
          "How to go to ISC Office?",
          "Where is the ISC Office?",
          "Where can I find the ISC Office?",
          "Can you tell me where the ISC Office is?",
          "Do you know where the ISC Office is?",
          "Where’s the ISC Office located?",
          "Could you tell me where the ISC Office is located?",
          "Where is the ISC Office situated?",
          "Where exactly is the ISC Office?",
          "Can you tell me the location of the International Students and Mobility Center (ISC) office?",
          "Where can I find the office for the International Students and Mobility Center (ISC)?",
          "What is the address of the International Students and Mobility Center (ISC) office?",
          "Do you know where the International Students and Mobility Center (ISC) office is located?",
          "Could you direct me to the International Students and Mobility Center (ISC) office?",
          "Where is the ISC office situated on campus?",
          "Can you show me where the International Students and Mobility Center (ISC) office is?",
          "Where exactly is the International Students and Mobility Center (ISC) office?",
          "Could you provide the location of the International Students and Mobility Center (ISC) office?",
          "Is there a map showing the location of the International Students and Mobility Center (ISC) office?",
          "Where is the International Students and Mobility Center (ISC) office located?",
          "Can you point me to the International Students and Mobility Center (ISC) office?",
          "I need to find the International Students and Mobility Center (ISC) office; where is it?",
          "Could you tell me how to get to the International Students and Mobility Center (ISC) office?",
          "Where should I go to find the International Students and Mobility Center (ISC) office?",
          "Where is the International Students and Mobility Center (ISC) office on campus?",
          "What building houses the International Students and Mobility Center (ISC) office?",
          "Can you help me locate the International Students and Mobility Center (ISC) office?",
          "I'm looking for the International Students and Mobility Center (ISC) office; where is it?",
          "Could you give me directions to the International Students and Mobility Center (ISC) office?"
        ],
        "responses": [
         "The ISC Office will be located at the first floor of Block G, Kompleks Perdanasiswa (KPS). Here is the link of Google Map to ISC Office: \n\nhttps://maps.app.goo.gl/Ck4LiLq9nMkU8h8k7 \n\nTo reach the ISC Office, you can take any bus within UM to get to UM Sentral. From there, it’s just a short walk to Kompleks Perdanasiswa (KPS)."
        ]
      },
      {
        "tag": "unable course module",
        "patterns": [
          "Why I cannot register my course in MAYA portal?",
          "Why can't I register for the course module?",
          "What should I do if I am unable to register for the course module?",
          "Is there an issue preventing me from registering for the course module?",
          "How can I resolve the problem of being unable to register for the course module?",
          "What are the reasons for not being able to register for the course module?",
          "Are there any steps I need to take if I can't register for the course module?",
          "Has anyone else encountered difficulties registering for the course module?",
          "What might be causing the inability to register for the course module?",
          "Is there a technical issue preventing course module registration?",
          "Who can assist me if I'm having trouble registering for the course module?",
          "What could be the reasons behind the failure to register for the course module?",
          "Is there a specific error message when attempting to register for the course module?",
          "Have there been any recent changes affecting registration for the course module?",
          "Is there a deadline or restriction affecting registration for the course module?",
          "Are there prerequisites I need to fulfill before registering for the course module?",
          "Is there a maximum capacity for the course module that has been reached?",
          "Are there any holds or blocks on my account preventing course module registration?",
          "Is there a specific process I need to follow to register for the course module?",
          "Has the registration period for the course module ended?",
          "Can you provide guidance on troubleshooting issues with course module registration?"
        ],
        "responses": [
          "If you are facing the registration course problems, there may be several factors that causes it to happens:\n\n- Not connected to the internet.\n- You are not entering the right username or password \n- MAYA portal is currently crashed as too many request from too many users.\n- You are trying to register courses where the Occurence is not 1M.\n\nIf any of the following problems ensure, please ensure that you are connected to the internet, entering the right username and password, and only register 1M Occurence courses. If the MAYA portal is too slow or crashed during your registration, make sure to stay updated with the Telegram group announcement and give it some time for the Portal to be fixed.\n\nIf you still have problems that is not answered by this respond, feel free to ask the buddies or email the ISC officer."
        ]
      },
      {
        "tag": "course module register",
        "patterns": [
          "What courses can mobility students register for at the university?",
          "Are there any restrictions on the courses mobility students can take?",
          "Can mobility students take courses from different faculties?",
          "What should a mobility student do if they want to take a course   that doesn't have an occurrence of 1M?",
          "Who should mobility students consult if they want to take a course not available to them?",
          "Is approval needed from any specific office or lecturer for certain courses?",
          "How are transfer credits handled for mobility students?",
          "What factors determine the transfer of credits for mobility students?",
          "Do mobility students need to get approval from their home university for course registration?",
          "What is the process for mobility students to register for courses outside of the standard occurrence?",
          "What course should I register for?",
          "How do I decide which course to register for?",
          "Is there guidance on choosing the right course to register for?",
          "Which course would be most suitable for me to register?",
          "What factors should I consider when choosing a course to register for?",
          "Can you help me determine which course to register for?",
          "Are there any recommendations for selecting a course to register for?",
          "What criteria should I use in selecting a course to register for?",
          "How can I make an informed decision about which course to register for?",
          "Are there advisors available to assist with choosing the right course to register for?",
          "What are some factors to consider when deciding which course to register for?",
          "Is there a process or guideline for selecting the appropriate course to register for?",
          "Are there any resources available to help me choose which course to register for?",
          "Can you provide tips on how to choose the best course to register for?",
          "Are there specific requirements I should consider when selecting a course to register for?",
          "What are the options available to me in terms of courses to register for?",
          "Is there a specific department or office I should consult regarding course registration?",
          "How can I ensure that the course I register for aligns with my academic or career goals?",
          "Are there any prerequisites or recommendations for the course I'm considering registering for?",
          "Who can provide advice or guidance on selecting the right course to register for?"
        ],
        "responses": [
          "Mobility students can only register for courses that have an occurrence of 1M. You may choose any of the courses, even those from different faculties.\n\nIf you want to take courses that do not have an occurrence of 1M, you need to ask the officers in the ISC Office and get approval from the lecturer.\n\nAny transfer credit-related matters will depend on the mobility student and their home university."
        ]
      },
      {
        "tag": "Not enough credits",
        "patterns": [
          "What should I do if I don't have enough credits?",
          "How can I address the issue of not having enough credits?",
          "What are my options if I am short on credits?",
          "Is there a way to make up for not having enough credits?",
          "What steps can I take to meet the credit requirements?",
          "Are there any alternatives available if I'm lacking credits?",
          "Who should I speak to if I am concerned about not having enough credits?",
          "Can you provide guidance on how to resolve the issue of insufficient credits?",
          "Is there a deadline for meeting the credit requirements?",
          "Are there any resources or support services available for students with insufficient credits?",
          "What are the consequences of not having enough credits?",
          "Is there a process for appealing or addressing the issue of insufficient credits?",
          "Are there any exceptions or waivers available for students with not enough credits?",
          "What impact does not having enough credits have on my academic progress?",
          "Are there specific courses or activities I can undertake to earn additional credits?",
          "How can I determine the number of credits I need to fulfill my requirements?",
          "Is there a minimum credit requirement for maintaining enrollment status?",
          "Are there any restrictions or limitations for students with insufficient credits?",
          "What strategies can I use to ensure I have enough credits for graduation?",
          "Who can I consult for assistance with planning my credit requirements?"
        ],
        "responses": [
          "Exchange students do not have a specific number of credits they need to take unless it is explicitly stated by their home university. If you do not meet the required amount of credits as specified by your university, you will need to meet with the ISC officer to resolve the issue. \n\nPlease make sure to bring any supporting documents that indicate you must take a certain number of credits."
        ]
      },
      {
        "tag": "Best place eat",
        "patterns": [
          "Where will you recommend me to eat?",
          "Where to eat?",
          "Where is the best place to eat?",
          "Can you recommend the top dining spots?",
          "What are the best restaurants in the area?",
          "Where can I find the most delicious food?",
          "What's the go-to place for a great meal?",
          "Which restaurants offer the finest dining experience?",
          "What are the top-rated eateries nearby?",
          "Where should I go for an unforgettable dining experience?",
          "What's the ultimate destination for food enthusiasts?",
          "Which dining establishments are highly recommended?",
          "Where can I find the tastiest food in town?",
          "Which dining spot offers the most bang for the buck?",
          "What's the top pick for a memorable dining experience?",
          "Are there any hidden gems for great food?",
          "Can you suggest a must-visit restaurant for food lovers?",
          "Where can I go for a special occasion dinner?",
          "What's the locals' favorite place to eat?",
          "Which restaurant has the best ambiance for a meal?",
          "Can you recommend a place with exceptional reviews for dining?"
        ],
        "responses": [
          "There are some popular places inside and outside of University Malaya that students love to go for meals.\n\nInside University Malaya:\n1. Kolej Kediaman 7 (KK7)\n2. Food Avenue, Kolej Kediaman 12 (KK12)\n3. Chicken Rice from Faculty of Arts and Social Science, University Malaya\n\nOutside University Malaya:\nThere are some franchise restaurants at any of the nearest malls. However, here are some of the University Malaya's students' favorite spots:\n1. Nasi Lemak Anjing (Restaurant Al-Ehsan)\n2. Nasi Lemak Bumbung\n3. Pokok KL\n4. Piccadilly Restaurant (Having 1001 menu items)\n5. Many More!!!!\n\nFeel free to ask anyone or even buddies for more suggestions!!!"
        ]
      },
      {
        "tag": "How to go",
        "patterns": [
          "By which mode of transportation?",
          "What transport options are available?",
          "With what means of travel?",
          "How can I get there?",
          "By what method of transportation?",
          "What are the available transportation choices?",
          "Through which transport means?",
          "Using which mode of transit?",
          "What transport alternatives exist?",
          "By what mode of travel?",
          "Which transportation options should I consider?",
          "What modes of transport are accessible?",
          "What are the available means of transportation?",
          "How should I travel to [destination]?",
          "What transportation modes are suitable for the journey?",
          "Which transport methods are recommended?",
          "What are the different ways to get there?",
          "Which forms of transportation are most convenient?",
          "What are my transport choices?",
          "Which transportation options are the most efficient?"
        ],
        "responses": [
          "You can explore Kuala Lumpur (KL) and the University of Malaya (UM) using the convenient public transport options available nearby. The LRT and MRT buses can take you to their respective train stations. For easy navigation and route planning, we recommend downloading the Moovit app. Alternatively, you can use Grab to reach your desired destinations.\n\nFrom University Malaya, you can access the LRT bus T789 at the following locations:\n- Law Faculty\n- Kolej Kediaman 1 (KK1)\n- Faculty of Engineering\n- UM Sentral\n- Dewan Tunku Canselor UM\n- Center of Foundation Studies of University of Malaya\n\nSimilarly, the MRT bus T815 can be accessed from these points within University Malaya:\n- Faculty of Business and Economics\n- UM Sentral\n- Center of Foundation Studies of University of Malaya\n- Kolej Kediaman 12 (KK12)\n- Kolej Kediaman 5 (KK5)\n- Kolej Kediaman 11 (KK11)\n- Kolej Kediaman 8 (KK8)\n- Faculty of Computer Science and Information Technology\n- Faculty of Malay Studies\n- Kolej Kediaman 4 (KK4)\n- Law Faculty\n- Kolej Kediaman 1 (KK1)\n- Faculty of Engineering\n\nYou can live track LRT, MRT, and other buses using the following link:\n\nhttps://myrapidbus.prasarana.com.my/kiosk?route=700&bus=\n\nAdditionally, there are shuttle buses available to help you navigate around the University of Malaya. Below are the PDF schedules and the stations each bus stops at.\n\n {PDF} UM Shuttle Bus Route and Schedule.pdf"
        ]
      },
      {
        "tag": "Touch 'n Go (TnG) card",
        "patterns": [
          "Where can I buy a Touch 'n Go card?",
          "How do I get a Touch 'n Go card?",
          "What are the steps to obtain a Touch 'n Go card?",
          "Can I buy a Touch 'n Go card online?",
          "Which locations sell Touch 'n Go cards?",
          "Is there a specific store to purchase a Touch 'n Go card?",
          "Are Touch 'n Go cards available at convenience stores?",
          "What documents do I need to buy a Touch 'n Go card?",
          "How much does a Touch 'n Go card cost?",
          "Can I get a Touch 'n Go card at the airport?",
          "Where can I recharge my Touch 'n Go card after purchasing it?",
          "Are there any promotions for getting a Touch 'n Go card?",
          "Is the Touch 'n Go card available at transit stations?",
          "Can I get a Touch 'n Go card at a kiosk?",
          "Do I need to register to get a Touch 'n Go card?",
          "Are Touch 'n Go cards sold at supermarkets?",
          "Can tourists buy a Touch 'n Go card?",
          "Is it possible to get a personalized Touch 'n Go card?",
          "Are Touch 'n Go cards available at petrol stations?",
          "Can I buy a Touch 'n Go card from a vending machine?"
        ],
        "responses": [
          "Touch 'n Go card is very useful for you to access public transport around KL. You will need Touch 'n Go card to ride the LRT, MRT, BRT, KTM, and their respective station busses. You can also use it for pay for your parking in the mall and also to buy some items from selected vending machine.\n\nYou can obtain a Touch 'n Go card from various locations. Here are the detailed steps and places where you can get one:\n\n1. Convenience Stores and Supermarkets:\n\n- Touch 'n Go cards are widely available at major convenience stores such as 7-Eleven, MyNews, and KK Mart.\n- You can also purchase them at larger supermarkets like AEON, Tesco, and Giant.\n\n2. Transit Stations:\n\n- Many major transit stations, including LRT, MRT, and monorail stations, sell Touch 'n Go cards at their customer service counters.\n- Some bus terminals also offer Touch 'n Go cards at their information or ticket counters.\n\n3. Touch 'n Go Hubs and Kiosks:\n\n- You can visit official Touch 'n Go hubs located in major shopping malls or transit hubs for purchasing a card.\n- There are also self-service kiosks available at some locations where you can buy and reload your card.\n\n4. Online Purchase:\n\n- Touch 'n Go cards can be purchased online through the official Touch 'n Go e-commerce site or through major e-commerce platforms like Lazada and Shopee.\n- Delivery options are available, and you may need to register an account for the purchase.\n\n5. Petrol Stations:\n\n- Selected petrol stations such as Shell, Petronas, and Caltex sell Touch 'n Go cards.\n\n6. Airports:\n\n- At major airports, you can find Touch 'n Go cards at convenience stores or designated counters in the arrivals area.\n\n7. Cost and Registration:\n\n- The price of a Touch 'n Go card is usually around RM10, and this may or may not include a preloaded balance.\n- Registration is not mandatory to purchase a standard card, but it is recommended for security and additional services. You can register your card online via the Touch 'n Go portal.\n\n8. Reloading Your Card:\n\n- Once you have your card, you can reload it at any of the above locations, as well as through online banking, mobile apps, and ATMs.\n- Look out for promotions and discounts that might be available when you purchase or reload your card.\n\n9. Tourists and Visitors:\n\n- Tourists can easily buy a Touch 'n Go card at the same locations as locals. It is a convenient option for travel and shopping within Malaysia.\n- Personalized Touch 'n Go cards with custom designs are available, usually through online orders or special promotions.\n\nBy following these guidelines, you can easily obtain and use a Touch 'n Go card for your convenience in Malaysia. If you have any further questions, feel free to ask any customer service representative at the respective stores or contact the Touch 'n Go customer service."
        ]
      }
    ]
  }